Repository: strankanakluc/wps-image-optimalization
Catalog: languages/*.po
Languages: sk_sk

source: Wps Image Optimalization Settings
sk_sk: WPS Optimalizácia obrázkov Nastavenia

source: Wps Image Optimalization
sk_sk: WPS Optimalizácia obrázkov

source: Settings
sk_sk: Nastavenia

source: Also keep the original image
sk_sk: Ponechajte aj pôvodný obrázok

source: Check if you want to keep the original file without optimization.
sk_sk: Začiarknite, či chcete zachovať pôvodný súbor bez optimalizácie.

source: If unchecked, the original image will be deleted after successful conversion to WebP, saving disk space.
sk_sk: Ak nie je začiarknuté, pôvodný obrázok sa po úspešnej konverzii na WebP odstráni, čím sa ušetrí miesto na disku.

source: Image Quality
sk_sk: Kvalita obrázku

source: Image quality after optimization (0-100). Higher quality takes up more storage. (0 - lowest, 100 - highest quality)
sk_sk: Kvalita obrázku po optimalizácii (0-100). Vyššia kvalita zaberá viac miesta. (0 – najnižšia, 100 – najvyššia kvalita)

source: The default value is 80.
sk_sk: Predvolená hodnota je 80.

source: Compression Method
sk_sk: Metóda kompresie

source: Image optimization (0-6).
sk_sk: Optimalizácia obrazu (0-6).

source: Higher value = greater image compression, which also means longer processing time during optimization.
sk_sk: Vyššia hodnota = väčšia kompresia obrazu, čo znamená aj dlhší čas spracovania pri optimalizácii.

source: Allowed Image Types
sk_sk: Povolené typy obrázkov

source: Images to be optimized:
sk_sk: Obrázky, ktoré sa majú optimalizovať:

source: The default images are JPEG, PNG, and GIF. Select other types if necessary. SVG files usually take up little space and do not need to be optimized.
sk_sk: Predvolené obrázky sú JPEG, PNG a GIF. V prípade potreby vyberte iné typy. Súbory SVG zvyčajne zaberajú málo miesta a nie je potrebné ich optimalizovať.

source: Copy file name to alt text
sk_sk: Skopíruje názov súboru do alternatívneho textu

source: Check to automatically set image alt text based on the filename.
sk_sk: Začiarknutím tejto možnosti sa automaticky nastaví alternatívny text obrázka podľa názvu súboru.

source: If you have SEO-friendly image titles, you can enable this option. Otherwise, leave the feature disabled.
sk_sk: Ak máte názvy obrázkov vhodné pre SEO, môžete túto možnosť povoliť. V opačnom prípade ponechajte funkciu zakázanú.

source: Maximum Image Width
sk_sk: Maximálna šírka obrázka

source: Set the maximum width for uploaded images (in pixels).
sk_sk: Nastavte maximálnu šírku pre nahraté obrázky (v pixeloch).

source: Images wider than this value will be resized before further optimization. The default value is 1200 pixels.
sk_sk: Veľkosť obrázkov širších ako táto hodnota sa pred ďalšou optimalizáciou zmení. Predvolená hodnota je 1200 pixelov.

source: Optimizes images when uploading. Define the maximum image size and choose which file types should be converted to webp and what the compression or quality of the optimized image should be.
sk_sk: Optimalizuje obrázky pri nahrávaní. Definujte maximálnu veľkosť obrázka a vyberte, ktoré typy súborov sa majú previesť na webp a aká by mala byť kompresia alebo kvalita optimalizovaného obrázka.
